In [146]:
import pandas as pd
import numpy as np

In [147]:
df = pd.read_csv('./output_salary_filtered.csv')
schema = pd.read_csv('./stack-overflow-survey-2023/survey_results_schema.csv')

In [148]:
# df.set_index('id')
df

,Country,ConvertedCompYearly,LanguageHaveWorkedWith,RemoteWork
0,United States of America,285000,HTML/CSS;JavaScript;Python,Remote
1,United States of America,250000,Bash/Shell (all shells);Go,"Hybrid (some remote, some in-person)"
2,United States of America,156000,Bash/Shell (all shells);HTML/CSS;JavaScript;PH...,"Hybrid (some remote, some in-person)"
3,Philippines,23456,HTML/CSS;JavaScript;TypeScript,Remote
4,United Kingdom of Great Britain and Northern I...,96828,Bash/Shell (all shells);HTML/CSS;JavaScript;Ru...,Remote
...,...,...,...,...
47322,Brazil,50719,C;C++,Remote
47323,Armenia,16917,Assembly;Bash/Shell (all shells);C;C#;C++;Java...,In-person
47324,India,15752,Dart;HTML/CSS;JavaScript;TypeScript,Remote
47325,France,64254,C#;F#;HTML/CSS;JavaScript;SQL;TypeScript,"Hybrid (some remote, some in-person)"
47326,Greece,61041,Java;JavaScript;TypeScript,In-person

In [149]:
df.groupby(['Country']).count()

,ConvertedCompYearly,LanguageHaveWorkedWith,RemoteWork
Country,,,
Afghanistan,5,4,5
Albania,17,17,17
Algeria,18,18,18
Andorra,5,5,5
Angola,1,1,1
...,...,...,...
"Venezuela, Bolivarian Republic of...",51,51,51
Viet Nam,103,102,103
Yemen,6,6,6
Zambia,9,9,9
Zimbabwe,10,10,10

In [150]:
grouped = df.groupby(['Country'])

### GroupBy Tutorial
https://sparkbyexamples.com/pandas/pandas-groupby-explained-with-examples

In [151]:
technologies = ({
    'Courses': ["Spark", "PySpark", "Hadoop", "Python", "Pandas", "Hadoop", "Spark", "Python", "NA", "Python"],
    'Fee': [22000, 25000, 23000, 10, 26000, 25000, 25000, 20, 1500, 30],
    'Duration': ['30days', '50days', '55days', '40days', '60days', '35days', '30days', '50days', '40days', '40days'],
    'Discount': [1000, 2300, 1000, 0, 2500, None, 1400, 10, 0, None]
})
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python     10   40days       0.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python     20   50days      10.0
8       NA   1500   40days       0.0
9   Python     30   40days       NaN

In [182]:
grouped = df.groupby(['Courses']).sum()

grouped

           Fee            Duration  Discount
Courses
Hadoop   48000        55days35days    1000.0
NA        1500              40days       0.0
Pandas   26000              60days    2500.0
PySpark  25000              50days    2300.0
Python      60  40days50days40days      10.0
Spark    47000        30days30days    2400.0

In [183]:
grouped_multi_col = df.groupby(['Courses', 'Duration']).sum()

grouped_multi_col

                    Fee  Discount
Courses Duration
Hadoop  35days    25000       0.0
        55days    23000    1000.0
NA      40days     1500       0.0
Pandas  60days    26000    2500.0
PySpark 50days    25000    2300.0
Python  40days       40       0.0
        50days       20      10.0
Spark   30days    47000    2400.0

In [185]:
df.groupby(by=['Courses'], dropna=False).sum()

           Fee            Duration  Discount
Courses
Hadoop   48000        55days35days    1000.0
NA        1500              40days       0.0
Pandas   26000              60days    2500.0
PySpark  25000              50days    2300.0
Python      60  40days50days40days      10.0
Spark    47000        30days30days    2400.0

In [205]:
# Using apply() & lambda
df.groupby(by='Courses').apply(lambda x: x.sort_values('Fee'))

           Courses    Fee Duration  Discount
Courses
Hadoop  2   Hadoop  23000   55days    1000.0
        5   Hadoop  25000   35days       NaN
NA      8       NA   1500   40days       0.0
Pandas  4   Pandas  26000   60days    2500.0
PySpark 1  PySpark  25000   50days    2300.0
Python  3   Python     10   40days       0.0
        7   Python     20   50days      10.0
        9   Python     30   40days       NaN
Spark   0    Spark  22000   30days    1000.0
        6    Spark  25000   30days    1400.0

In [217]:
df.groupby('Courses')['Fee'].aggregate(['min','max'])

           min    max
Courses
Hadoop   23000  25000
NA        1500   1500
Pandas   26000  26000
PySpark  25000  25000
Python      10     30
Spark    22000  25000